package com.makariosfayez.jesusdiciples

import android.support.v7.app.AppCompatActivity
import android.os.Bundle
import android.widget.ListView
import android.widget.Toast
import kotlinx.android.synthetic.main.activity_main.*
import java.io.BufferedReader
import java.io.IOException
import java.io.InputStreamReader

class MainActivity : AppCompatActivity() {

  private  val list = ArrayList<data>()

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)

        var text = ""
        var reader: BufferedReader? = null

        try {
            reader = BufferedReader(InputStreamReader(assets.open("metiasdet.txt")))
            text = reader.readLines().joinToString("\n")
        } catch (e: IOException) {
            Toast.makeText(applicationContext, "Error reading license file!", Toast.LENGTH_SHORT).show()
            e.printStackTrace()
        } finally {
            try {
                reader?.close()
            } catch (e: IOException) {
                //log the exception
                e.printStackTrace()
            }
        }


        list.add(data("القديس بطرس الرسول" , "هو سمعان بن يونا معني اسمه صخرة وحجر. ولد في قرية بيت صيدا الواقعة على بحر طبرية قبل ميلاد السيد المسيح بعده سنوات، قد تصل إلى العشرة وتزيد قليلًا. وكان يشتغل بصيد الأسماك شأنه في ذلك شأن الكثيرين من سكان قريته.... يحتمل أنه كان -مع أخيه اندراوس- تلميذًا ليوحنا المعمدان.", R.drawable.peter))
        list.add(data("القديس اندراوس الرسول","هو شقيق بطرس الرسول (يو 1: 40) معني اسمه \"ذو مروءة\" كان في بادئ أمره تلميذًا ليوحنا المعمدان ومنه سمع عن الرب يسوع، فقصده ومكث معه يوما كاملًا ليعاين أعماله وأقواله فأيقن أنه المسيا المنتظر.. بعدها بشر أخاه بطرس بأنه وجد المسيا.. وبعد معجزة صيد السمك الكثير دعاه الرب مع أخيه بطرس ليكون صيادا للناس، فترك السفينة والشباك وتبع المسيح ولم يفارقه منذ ذلك الحين.", R.drawable.andrew))
        list.add(data("القديس يعقوب الكبير ابن زبدي","هو ابن زبدي وشقيق يوحنا الحبيب.. ويدعي أيضًا يعقوب الكبير تمييزًا له عن يعقوب الصغير (ابن حلفي). كان من بيت صيدا من مدينة بطرس وأندراوس. دعاه السيد المسيح للتلمذة مع أخيه يوحنا في نفس المرة التي دعا فيها بطرس واندراوس، فتركا السفينة وأباهما وتبعاه (مت 4: 21، 22) ويبدو أن يعقوب كان حاضرًا معجزة الرب يسوع الأولى في قانا الجليل حيث حول الماء خمرًا (يو 2: 2).",R.drawable.james))
        list.add(data("القديس يوحنا الحبيب","وهو الذي اتكأ على صدره في العشاء الأخير هو الرسول الذي جمع في شخصه بين حب البتولية والعظمة الحقيقية، والبساطة القلبية، مع المحبة الفائقة العجيبة. هو الذي انفرد من بين التلاميذ في سيره بدون خوف وراء المخلص في الوقت العصيب الذي تركه الجميع وانفضوا من حوله." , R.drawable.john))
        list.add(data("القديس فيلبس التلميذ" , " ولد في بيت صيدا (يو1: 44) اسم يوناني معناه (محب للخير)..\n" +
                "ويبدو أنه عكف منذ صباه على دراسة الكتب المقدسة. فنحن نجده سريعًا لتلبية دعوة الرب حالما قال له اتبعني، ونجد في حديثة إلى (نثنائيل) \"وقد وجدنا الذي كتب عنه موسي في الناموس والأنبياء، يسوع..\" (يو1: 45)، ما يدل على الانتظار والتوقع." ,R.drawable.phillb))
        list.add(data("القديس برثولماوس الرسول" ," يكاد يكون هناك إجماع بين العلماء أن برثولماوس هو عينه نثنائيل الذي ذكره يوحنا في إنجيله، أن فيلبس أحضره للمسيح (يو 1: 45)..... والدليل على ذلك أن يوحنا يذكره في أول بشارته وآخرها بينما البشائر الثلاثة الأخرى تذكر فيلبس وبرثولماوس بين أسماء الرسل استنتجوا من ذلك أن برثولماوس هو نثنائيل." , R.drawable.barthelmawos))
        list.add(data("القديس توما الرسول" , "كان من الجليل ومعني اسمه التوأم كما ذكر يوحنا الإنجيلي (11: 16: 21: 2) دعاه الرب يسوع إلى شرف التلمذة فلبي الدعوة وتبعه ورافقه مع بقية التلاميذ، ورأي آياته واستمع إلى تعاليمه الإلهية." , R.drawable.toma))
        list.add(data("القديس متى الرسول" , "كان من الجليل ويدعي لاوي كان عشارًا وكان العشارون جباة رسميين يعملون لحساب الرومان المستعمرون لذلك كانوا ممقوتين لدي الشعب ومعتبرين خطاه في نظر عامة الناس دعاه الرب أن يتبعه وكان جالسًا عند مكان الجباية فترك كل شيء وقام وتبعه.", R.drawable.mata))
        list.add(data("القديس يعقوب ابن حلفى" , "هو يعقوب بن حلفي أحد الاثني عشر رسولًا، وهو أحد الأعمدة الثلاثة لكنيسة الختان كما دعاه معلمنا بولس (غل 2: 7-9). عُرِف باسم يعقوب أخا الرب، لأنه ابن خالته بالجسد من مريم زوجه كولوبا. فكلمة \"حلفا\" آرامية ويقابلها (كلوبا) في اليونانية وعرف باسم يعقوب الصغير (مر 15: 40) تميزًا له عن يعقوب الكبير بن زبدي." , R.drawable.jacob))
        list.add(data("القديس يهوذا لباوس المُلَقَّب تداوس","ويدعي أيضًا تداوس ولباوس ويهوذا أخًا يعقوب تمييزًا له عن يهوذا الإسخريوطي الذي أسلم الرب (.. والتقليد القديم يؤكد أنه اخو يعقوب كما ذكر القديس لوقا في إنجيله وفي سفر الأعمال – ليس ابن يعقوب كما في الترجمة السريانية..) هو أحد الأربعة المذكورين في كتاب العهد الجديد أخوة الرب" , R.drawable.saint_jude))
        list.add(data("القديس سمعان القانوي الرسول" , "ذكره كل من متى ومرقس باسم القانوي (مت 10: 4؛ مر 3: 18) وذكره لوقا في إنجيله وسفر الأعمال باسم الغيور ويقول أن التسمية (الغيور) هي المرادف اليوناني للكلمة العبرية \"القانوي\"." , R.drawable.stsimon))
        list.add(data("القديس متياس الرسول" ,  text , R.drawable.metias))


        val listView = myListView as ListView
        val adapter = CustomAdapter(this , R.layout.custom_listview , list)
        listView.adapter = adapter

    }
}
